<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"a717181e942adea1b7a99b18939a8a4e4da33b4d7a1617bb9dbb8c47b5a7424a","plan_job_ref":"Job Terraform Plan #66 at https://github.com/cal-itp/data-infra/actions/runs/14412165154","plan_out_hash":"e558e21a390a289464abf84830a80d6ee92340272c1535f323391610f8187699","plan_hash":"ec727593300de489a380d1f91bab61a4430668848cdc9043a33089764a30c718","plan_text_format":"diff","version":"1.48.0"} -->
Terraform plan in __iac/cal-itp-data-infra/iam/us__
<details>
<summary>Plan: 13 to add, 0 to change, 6 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
-   destroy

Terraform will perform the following actions:

  # google_project_iam_member.github-actions-service-account["roles/bigquery.dataViewer"] will be created
+   resource "google_project_iam_member" "github-actions-service-account" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = (known after apply)
+       project = "cal-itp-data-infra"
+       role    = "roles/bigquery.dataViewer"
    }

  # google_project_iam_member.github-actions-service-account["roles/bigquery.jobUser"] will be created
+   resource "google_project_iam_member" "github-actions-service-account" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = (known after apply)
+       project = "cal-itp-data-infra"
+       role    = "roles/bigquery.jobUser"
    }

  # google_project_iam_member.github-actions-service-account["roles/bigquery.readSessionUser"] will be created
+   resource "google_project_iam_member" "github-actions-service-account" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = (known after apply)
+       project = "cal-itp-data-infra"
+       role    = "roles/bigquery.readSessionUser"
    }

  # google_project_iam_member.github-actions-service-account["roles/composer.admin"] will be created
+   resource "google_project_iam_member" "github-actions-service-account" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = (known after apply)
+       project = "cal-itp-data-infra"
+       role    = "roles/composer.admin"
    }

  # google_project_iam_member.github-actions-service-account["roles/storage.admin"] will be created
+   resource "google_project_iam_member" "github-actions-service-account" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = (known after apply)
+       project = "cal-itp-data-infra"
+       role    = "roles/storage.admin"
    }

  # google_project_iam_member.github-actions-terraform["roles/editor"] will be created
+   resource "google_project_iam_member" "github-actions-terraform" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = (known after apply)
+       project = "cal-itp-data-infra"
+       role    = "roles/editor"
    }

  # google_project_iam_member.github-actions-terraform["roles/resourcemanager.projectIamAdmin"] will be created
+   resource "google_project_iam_member" "github-actions-terraform" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = (known after apply)
+       project = "cal-itp-data-infra"
+       role    = "roles/resourcemanager.projectIamAdmin"
    }

  # google_project_iam_member.github-actions-terraform["roles/storage.admin"] will be created
+   resource "google_project_iam_member" "github-actions-terraform" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = (known after apply)
+       project = "cal-itp-data-infra"
+       role    = "roles/storage.admin"
    }

  # google_project_iam_member.tfer--terraform-membership["roles/editor"] will be destroyed
  # (because google_project_iam_member.tfer--terraform-membership is not in configuration)
-   resource "google_project_iam_member" "tfer--terraform-membership" {
-       etag    = "BwYx2LW3K/A=" -> null
-       id      = "cal-itp-data-infra/roles/editor/serviceAccount:github-actions-terraform@cal-itp-data-infra.iam.gserviceaccount.com" -> null
-       member  = "serviceAccount:github-actions-terraform@cal-itp-data-infra.iam.gserviceaccount.com" -> null
-       project = "cal-itp-data-infra" -> null
-       role    = "roles/editor" -> null
    }

  # google_project_iam_member.tfer--terraform-membership["roles/resourcemanager.projectIamAdmin"] will be destroyed
  # (because google_project_iam_member.tfer--terraform-membership is not in configuration)
-   resource "google_project_iam_member" "tfer--terraform-membership" {
-       etag    = "BwYx2LW3K/A=" -> null
-       id      = "cal-itp-data-infra/roles/resourcemanager.projectIamAdmin/serviceAccount:github-actions-terraform@cal-itp-data-infra.iam.gserviceaccount.com" -> null
-       member  = "serviceAccount:github-actions-terraform@cal-itp-data-infra.iam.gserviceaccount.com" -> null
-       project = "cal-itp-data-infra" -> null
-       role    = "roles/resourcemanager.projectIamAdmin" -> null
    }

  # google_project_iam_member.tfer--terraform-membership["roles/storage.admin"] will be destroyed
  # (because google_project_iam_member.tfer--terraform-membership is not in configuration)
-   resource "google_project_iam_member" "tfer--terraform-membership" {
-       etag    = "BwYyTJ3C+dw=" -> null
-       id      = "cal-itp-data-infra/roles/storage.admin/serviceAccount:github-actions-terraform@cal-itp-data-infra.iam.gserviceaccount.com" -> null
-       member  = "serviceAccount:github-actions-terraform@cal-itp-data-infra.iam.gserviceaccount.com" -> null
-       project = "cal-itp-data-infra" -> null
-       role    = "roles/storage.admin" -> null
    }

  # google_service_account.github-actions-service-account will be created
+   resource "google_service_account" "github-actions-service-account" {
+       account_id   = "******************************"
+       description  = "Service account for general Github Actions tasks"
+       disabled     = false
+       display_name = "github-actions"
+       email        = (known after apply)
+       id           = (known after apply)
+       member       = (known after apply)
+       name         = (known after apply)
+       project      = "cal-itp-data-infra"
+       unique_id    = (known after apply)
    }

  # google_service_account.github-actions-terraform will be created
+   resource "google_service_account" "github-actions-terraform" {
+       account_id   = "************************"
+       description  = "Service account for Github Actions to run Terraform"
+       disabled     = false
+       display_name = "github-actions-terraform"
+       email        = (known after apply)
+       id           = (known after apply)
+       member       = (known after apply)
+       name         = (known after apply)
+       project      = "cal-itp-data-infra"
+       unique_id    = (known after apply)
    }

  # google_service_account.tfer--terraform will be destroyed
  # (because google_service_account.tfer--terraform is not in configuration)
-   resource "google_service_account" "tfer--terraform" {
-       account_id   = "github-actions-terraform" -> null
-       description  = "Service account for Github Actions to run Terraform" -> null
-       disabled     = false -> null
-       display_name = "Terraform" -> null
-       email        = "github-actions-terraform@cal-itp-data-infra.iam.gserviceaccount.com" -> null
-       id           = "projects/cal-itp-data-infra/serviceAccounts/github-actions-terraform@cal-itp-data-infra.iam.gserviceaccount.com" -> null
-       member       = "serviceAccount:github-actions-terraform@cal-itp-data-infra.iam.gserviceaccount.com" -> null
-       name         = "projects/cal-itp-data-infra/serviceAccounts/github-actions-terraform@cal-itp-data-infra.iam.gserviceaccount.com" -> null
-       project      = "cal-itp-data-infra" -> null
-       unique_id    = "117244690233377378433" -> null
    }

  # google_service_account_iam_member.github-actions--github-actions-service-accoun will be destroyed
  # (because google_service_account_iam_member.github-actions--github-actions-service-accoun is not in configuration)
-   resource "google_service_account_iam_member" "github-actions--github-actions-service-accoun" {
-       etag               = "BwYwko3QHQs=" -> null
-       id                 = "projects/cal-itp-data-infra/serviceAccounts/github-actions-services-accoun@cal-itp-data-infra.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principalSet://iam.googleapis.com/projects/1005246706141/locations/global/workloadIdentityPools/github-actions-pool/attribute.repository/cal-itp/data-infra" -> null
-       member             = "principalSet://iam.googleapis.com/projects/1005246706141/locations/global/workloadIdentityPools/github-actions-pool/attribute.repository/cal-itp/data-infra" -> null
-       role               = "roles/iam.workloadIdentityUser" -> null
-       service_account_id = "projects/cal-itp-data-infra/serviceAccounts/github-actions-services-accoun@cal-itp-data-infra.iam.gserviceaccount.com" -> null
    }

  # google_service_account_iam_member.github-actions--github-actions-services-accoun will be created
+   resource "google_service_account_iam_member" "github-actions--github-actions-services-accoun" {
+       etag               = (known after apply)
+       id                 = (known after apply)
+       member             = "principalSet://iam.googleapis.com/projects/1005246706141/locations/global/workloadIdentityPools/github-actions-pool/attribute.repository/cal-itp/data-infra"
+       role               = "roles/iam.workloadIdentityUser"
+       service_account_id = "*********************************************************************************************************************"
    }

  # google_service_account_iam_member.github-actions--service-account will be destroyed
  # (because google_service_account_iam_member.github-actions--service-account is not in configuration)
-   resource "google_service_account_iam_member" "github-actions--service-account" {
-       etag               = "BwYugw+Pc6Q=" -> null
-       id                 = "projects/cal-itp-data-infra/serviceAccounts/github-actions-terraform@cal-itp-data-infra.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principalSet://iam.googleapis.com/projects/1005246706141/locations/global/workloadIdentityPools/github-actions-pool/attribute.repository/cal-itp/data-infra" -> null
-       member             = "principalSet://iam.googleapis.com/projects/1005246706141/locations/global/workloadIdentityPools/github-actions-pool/attribute.repository/cal-itp/data-infra" -> null
-       role               = "roles/iam.workloadIdentityUser" -> null
-       service_account_id = "projects/cal-itp-data-infra/serviceAccounts/github-actions-terraform@cal-itp-data-infra.iam.gserviceaccount.com" -> null
    }

  # google_service_account_iam_member.github-actions-service-account will be created
+   resource "google_service_account_iam_member" "github-actions-service-account" {
+       etag               = (known after apply)
+       id                 = (known after apply)
+       member             = "principalSet://iam.googleapis.com/projects/1005246706141/locations/global/workloadIdentityPools/github-actions-pool/attribute.repository/cal-itp/data-infra"
+       role               = "roles/iam.workloadIdentityUser"
+       service_account_id = (known after apply)
    }

  # google_service_account_iam_member.github-actions-terraform will be created
+   resource "google_service_account_iam_member" "github-actions-terraform" {
+       etag               = (known after apply)
+       id                 = (known after apply)
+       member             = "principalSet://iam.googleapis.com/projects/1005246706141/locations/global/workloadIdentityPools/github-actions-pool/attribute.repository/cal-itp/data-infra"
+       role               = "roles/iam.workloadIdentityUser"
+       service_account_id = (known after apply)
    }

Plan: 13 to add, 0 to change, 6 to destroy.

Changes to Outputs:
-   google_service_account_terraform_email                                                                                                                                                                                        = "github-actions-terraform@cal-itp-data-infra.iam.gserviceaccount.com" -> null
```
</details>

:memo: Plan generated in [Terraform Plan #66](https://github.com/cal-itp/data-infra/actions/runs/14412165154)